#!/usr/bin/env python
# coding: utf-8

# 1:


x = int(input("Введите 16-битное число в 16 с/с: "), 16)
mask = int("1111000000000000", 2)
print()
print("Получено число:", hex(x))
print("Используется маска:", hex(mask))
print("Найден результат:", hex(x | mask))


# 2:


x = int(input("Введите 16-битное число в 16 с/с: "), 16)
mask = int("1111010111110111", 2)
print()
print("Получено число:", hex(x))
print("Используется маска:", hex(mask))
print("Найден результат:", hex(x & mask))


# 3:


x = int(input("Введите 16-битное число в 16 с/с: "), 16)
print()
print("Получено число:", hex(x))
print("Найден результат:", hex(x << 9))


# 4:


x = int(input("Введите 16-битное число в 16 с/с: "), 16)
print()
print("Получено число:", hex(x))
print("Найден результат:", hex(x >> 9))


# 5:


x = int(input("Введите 16-битное число в 16 с/с: "), 16)
n = int(input("Введите номер n-го бита (от 0 до 15): "))
mask = int("0000000000000001", 2)
print()
print("Получено число:", hex(x))
print("Используется маска:", hex(mask))
print("Номер обнуляемого бита:", n)
print("Найден результат:", hex(x & ~(mask << n)))




